import React, {useState, useRef, useEffect} from 'react'
import { Marker, Popup} from 'react-leaflet'

// original information source is 
// http://chizujoho.jpn.org/01_chizujoho/39/mi39_2.html
// http://chizujoho.jpn.org/01_chizujoho/39/mi39_2_img/100.csv

const name_poses = [
    {
      'name':'利尻山',
      'pos':[45.1786111,141.2419444],
    },
    {
      'name':'羅臼岳',
      'pos':[44.0758333,145.1222222],
    },
    {
      'name':'斜里岳',
      'pos':[43.7655555,144.7177777],
    },
    {
      'name':'阿寒岳',
      'pos':[43.3866666,144.0088888],
    },
    {
      'name':'大雪山',
      'pos':[43.6636111,142.8541666],
    },
    {
      'name':'トムラウシ山',
      'pos':[43.5272222,142.8488888],
    },
    {
      'name':'十勝岳',
      'pos':[43.4180555,142.6863888],
    },
    {
      'name':'幌尻岳',
      'pos':[42.7194444,142.6827777],
    },
    {
      'name':'後方羊蹄山',
      'pos':[42.8266666,140.8113888],
    },
    {
      'name':'岩木山',
      'pos':[40.6558333,140.3030555],
    },
    {
      'name':'八甲田山',
      'pos':[40.6588888,140.8772222],
    },
    {
      'name':'八幡平',
      'pos':[39.9577777,140.8541666],
    },
    {
      'name':'岩手山',
      'pos':[39.8525,141.0011111],
    },
    {
      'name':'早池峰山',
      'pos':[39.5586111,141.4886111],
    },
    {
      'name':'鳥海山',
      'pos':[39.0991666,140.0488888],
    },
    {
      'name':'月山',
      'pos':[38.5488888,140.0269444],
    },
    {
      'name':'朝日岳',
      'pos':[38.2605555,139.9222222],
    },
    {
      'name':'蔵王山',
      'pos':[38.1436111,140.44],
    },
    {
      'name':'飯豊山',
      'pos':[37.8547222,139.7072222],
    },
    {
      'name':'吾妻山',
      'pos':[37.7383333,140.1408333],
    },
    {
      'name':'安達太良山',
      'pos':[37.6211111,140.2877777],
    },
    {
      'name':'磐梯山',
      'pos':[37.6008333,140.0722222],
    },
    {
      'name':'駒ヶ岳',
      'pos':[37.0475,139.3536111],
    },
    {
      'name':'那須岳',
      'pos':[37.1247222,139.9627777],
    },
    {
      'name':'駒ヶ岳',
      'pos':[37.1236111,139.0752777],
    },
    {
      'name':'平ヶ岳',
      'pos':[37.0019444,139.1708333],
    },
    {
      'name':'巻機山',
      'pos':[36.9786111,138.9641666],
    },
    {
      'name':'燧ヶ岳',
      'pos':[36.955,139.2852777],
    },
    {
      'name':'至仏山',
      'pos':[36.9036111,139.1733333],
    },
    {
      'name':'谷川岳',
      'pos':[36.8372222,138.93],
    },
    {
      'name':'雨飾山',
      'pos':[36.9019444,137.9625],
    },
    {
      'name':'苗場山',
      'pos':[36.8458333,138.6902777],
    },
    {
      'name':'妙高山',
      'pos':[36.8913888,138.1136111],
    },
    {
      'name':'火打山',
      'pos':[36.9227777,138.0680555],
    },
    {
      'name':'高妻山',
      'pos':[36.8,138.0519444],
    },
    {
      'name':'男体山',
      'pos':[36.765,139.4908333],
    },
    {
      'name':'白根山',
      'pos':[36.7986111,139.3758333],
    },
    {
      'name':'皇海山',
      'pos':[36.69,139.3369444],
    },
    {
      'name':'武尊山',
      'pos':[36.8052777,139.1325],
    },
    {
      'name':'赤城山',
      'pos':[36.5602777,139.1933333],
    },
    {
      'name':'本白根山',
      'pos':[36.6227777,138.5319444],
    },
    {
      'name':'四阿山',
      'pos':[36.5416666,138.4130555],
    },
    {
      'name':'浅間山',
      'pos':[36.4063888,138.5230555],
    },
    {
      'name':'筑波山',
      'pos':[36.2252777,140.1066666],
    },
    {
      'name':'白馬岳',
      'pos':[36.7586111,137.7586111],
    },
    {
      'name':'五龍岳',
      'pos':[36.6583333,137.7527777],
    },
    {
      'name':'鹿島槍ヶ岳',
      'pos':[36.6244444,137.7469444],
    },
    {
      'name':'剱岳',
      'pos':[36.6233333,137.6169444],
    },
    {
      'name':'立山',
      'pos':[36.5758333,137.6197222],
    },
    {
      'name':'薬師岳',
      'pos':[36.4688888,137.5447222],
    },
    {
      'name':'黒部五郎岳',
      'pos':[36.3925,137.54],
    },
    {
      'name':'水晶岳',
      'pos':[36.4263888,137.6027777],
    },
    {
      'name':'鷲羽岳',
      'pos':[36.4030555,137.6052777],
    },
    {
      'name':'槍ヶ岳',
      'pos':[36.3419444,137.6475],
    },
    {
      'name':'穂高岳',
      'pos':[36.2891666,137.6480555],
    },
    {
      'name':'常念岳',
      'pos':[36.3255555,137.7275],
    },
    {
      'name':'笠ヶ岳',
      'pos':[36.3155555,137.5502777],
    },
    {
      'name':'焼岳',
      'pos':[36.2269444,137.5869444],
    },
    {
      'name':'乗鞍岳',
      'pos':[36.1063888,137.5536111],
    },
    {
      'name':'御嶽山',
      'pos':[35.8927777,137.4802777],
    },
    {
      'name':'美ヶ原',
      'pos':[36.2258333,138.1075],
    },
    {
      'name':'霧ヶ峰',
      'pos':[36.1030555,138.1966666],
    },
    {
      'name':'蓼科山',
      'pos':[36.1036111,138.295],
    },
    {
      'name':'八ヶ岳',
      'pos':[35.9708333,138.37],
    },
    {
      'name':'両神山',
      'pos':[36.0233333,138.8413888],
    },
    {
      'name':'雲取山',
      'pos':[35.8555555,138.9438888],
    },
    {
      'name':'甲武信ヶ岳',
      'pos':[35.9088888,138.7288888],
    },
    {
      'name':'金峰山',
      'pos':[35.8713888,138.6252777],
    },
    {
      'name':'瑞牆山',
      'pos':[35.8933333,138.5919444],
    },
    {
      'name':'大菩薩嶺',
      'pos':[35.7488888,138.8455555],
    },
    {
      'name':'丹沢山',
      'pos':[35.4863888,139.1388888],
    },
    {
      'name':'富士山',
      'pos':[35.3608333,138.7275],
    },
    {
      'name':'天城山',
      'pos':[34.8627777,139.0016666],
    },
    {
      'name':'駒ヶ岳',
      'pos':[35.7894444,137.8044444],
    },
    {
      'name':'空木岳',
      'pos':[35.7188888,137.8172222],
    },
    {
      'name':'恵那山',
      'pos':[35.4436111,137.5972222],
    },
    {
      'name':'駒ヶ岳',
      'pos':[35.7580555,138.2366666],
    },
    {
      'name':'仙丈ヶ岳',
      'pos':[35.72,138.1836111],
    },
    {
      'name':'鳳凰山',
      'pos':[35.7016666,138.3047222],
    },
    {
      'name':'北岳',
      'pos':[35.6744444,138.2388888],
    },
    {
      'name':'間ノ岳',
      'pos':[35.6461111,138.2283333],
    },
    {
      'name':'塩見岳',
      'pos':[35.5738888,138.1830555],
    },
    {
      'name':'悪沢岳',
      'pos':[35.5008333,138.1825],
    },
    {
      'name':'赤石岳',
      'pos':[35.4611111,138.1572222],
    },
    {
      'name':'聖岳',
      'pos':[35.4227777,138.1397222],
    },
    {
      'name':'光岳',
      'pos':[35.3380555,138.0838888],
    },
    {
      'name':'白山',
      'pos':[36.155,136.7713888],
    },
    {
      'name':'荒島岳',
      'pos':[35.9341666,136.6013888],
    },
    {
      'name':'伊吹山',
      'pos':[35.4177777,136.4063888],
    },
    {
      'name':'大台ヶ原山',
      'pos':[34.1852777,136.1091666],
    },
    {
      'name':'大峰山',
      'pos':[34.1736111,135.9075],
    },
    {
      'name':'大山',
      'pos':[35.3711111,133.5461111],
    },
    {
      'name':'剣山',
      'pos':[33.8536111,134.0941666],
    },
    {
      'name':'石鎚山',
      'pos':[33.7677777,133.115],
    },
    {
      'name':'九重連山',
      'pos':[33.0822222,131.2408333],
    },
    {
      'name':'祖母山',
      'pos':[32.8280555,131.3469444],
    },
    {
      'name':'阿蘇山',
      'pos':[32.8844444,131.1038888],
    },
    {
      'name':'霧島山',
      'pos':[31.9341666,130.8616666],
    },
    {
      'name':'開聞岳',
      'pos':[31.18,130.5283333],
    },
    {
      'name':'宮之浦岳',
      'pos':[30.3361111,130.5041666],
    },
  ];

  function Hyakumeisan({map, onIndexChanged}) {
    const [flying, setFlying] = useState(false)
    const indexRef = useRef()
    useEffect(()=>{
        // 最初は富士山
        flyToIndex(71)
    },[indexRef])
  
    const flyToIndex = (newIndex) =>{
        if (newIndex < 0) {
            newIndex = 0
        } else if (100 <= newIndex) {
            newIndex = 99
        }
        console.log("Fly to " + newIndex.toString(10) + ":" + name_poses[newIndex].name)
        map.flyTo(name_poses[newIndex].pos)
        indexRef.current = newIndex
        if (onIndexChanged) {
            onIndexChanged(newIndex, name_poses[newIndex].name)
        }
    }

    const onStartStop = ()=>{
      if (flying) {
        setFlying(()=>false)
      } else {
        flyToIndex(indexRef.current)
        setFlying(()=>true)
      }
    }

    const onForward = (step)=>{
        flyToIndex(indexRef.current + step)
    }

    return (
      <p>
        <button onClick={()=>onForward(-10)}>{"<< 10"}</button>
        <button onClick={()=>onForward(-5)} >{"<< 5"}</button>
        <button onClick={()=>onForward(-1)} >{"<< 1"}</button>
        <button onClick={()=>onForward(1)} >{"1 >>"}</button>
        <button onClick={()=>onForward(5)} >{"5 >>"}</button>
        <button onClick={()=>onForward(10)}>{"10 >>"}</button>
      </p>      
    )
  }

  function Markers() {
    return (
      name_poses.map((name_pos, index) => {
        return (
  <Marker position={name_pos.pos} key={index}>
      <Popup>
          {name_pos.name}
      </Popup>
  </Marker>
        )
      }        
  )
    )
  }
  
export {Markers}
export default Hyakumeisan
  